{
  "name": "Employment Agreement",
  "description": "Standard employment agreement template",
  "required_variables": ["employee_name", "position", "salary", "effective_date", "jurisdiction"],
  "optional_variables": ["benefits", "vacation_days", "notice_period"],
  "template": "EMPLOYMENT AGREEMENT\n\nThis Employment Agreement (\"Agreement\") is entered into as of {{ effective_date }} between {{ company_name }} (\"Employer\") and {{ employee_name }} (\"Employee\").\n\n1. POSITION AND DUTIES\n\nEmployee shall serve as {{ position }} and shall perform all duties and responsibilities customarily associated with this position. Employee shall report to the Manager designated by Employer.\n\n2. COMPENSATION\n\nEmployer shall pay Employee an annual salary of ${{ salary }}, payable in accordance with Employer's standard payroll practices.\n\n3. BENEFITS\n\nEmployee shall be entitled to the following benefits:\n(a) Health insurance coverage under Employer's group health plan\n(b) Retirement plan participation as provided by Employer\n(c) {{ vacation_days | default('20') }} days of paid vacation annually\n(d) Paid sick leave as required by law\n(e) Other benefits as outlined in Employer's employee handbook\n\n4. EMPLOYMENT AT WILL\n\nThis is an at-will employment relationship. Either party may terminate employment at any time, with or without cause, upon written notice as specified herein.\n\n5. TERMINATION NOTICE\n\nUnless terminated for cause, either party must provide {{ notice_period | default('30 days') }} written notice of intention to terminate employment.\n\n6. CONFIDENTIALITY\n\nEmployee acknowledges that during employment, Employee will have access to Employer's confidential information, including trade secrets, business plans, and customer information. Employee agrees to maintain the confidentiality of such information during and after employment.\n\n7. INTELLECTUAL PROPERTY\n\nAny work product, inventions, or intellectual property created by Employee during employment shall be the exclusive property of Employer.\n\n8. NON-COMPETE\n\nDuring employment and for {{ notice_period | default('6 months') }} thereafter, Employee shall not engage in any business competitive with Employer within Employer's geographic service area.\n\n9. GOVERNING LAW\n\nThis Agreement shall be governed by the laws of {{ jurisdiction }}, without regard to conflict of law principles.\n\n10. ENTIRE AGREEMENT\n\nThis Agreement constitutes the entire agreement between the parties and supersedes all prior negotiations and agreements.\n\nIN WITNESS WHEREOF, the parties have executed this Agreement as of the Effective Date.\n\nEMPLOYER:\n{{ company_name }}\n\nBy: _________________________\nName: _______________________\nTitle: ________________________\nDate: ________________________\n\nEMPLOYEE:\n\nSignature: ____________________\nName: ________________________\nDate: ________________________"
}
